app/controllers/bulletin_board_messages_controller.rb

SELECT * FROM "bulletin_board_messages" WHERE ("bulletin_board_messages".project_id = 1) ORDER BY id DESC
---
  def index
    @bulletin_board_messages = @project.bulletin_board_messages.find(:all, :order => "id DESC")