app/controllers/ideas_controller.rb

  def index

		@path = [link_to_ideas]
		@subnavigation = [link_to_new_idea, link_to_show_all_ideas("Alle Ideen", "title", "ASC", "", 0, 30)]

		@categories = Category.all
---
SELECT * FROM "categories"

	def show_all

		@categories = Category.all

		@idea = Idea.new

		@order = params[:order]
		@direction = params[:direction]
		@category = params[:category]

		if params[:page] != nil
			@page = params[:page]
		else
			@page = 1
		end

		if @category == nil
			@ideas = Idea.paginate :all, :page => @page, :order => @order+" "+@direction
---
SELECT * FROM "categories"
SELECT * FROM "ideas" ORDER BY title ASC LIMIT 30 OFFSET 0

  def show
    @idea = Idea.find(params[:id])
		@category = Category.find_by_id(@idea.category_id)

		@path = [link_to_ideas, link_to_idea(@idea)]
		@subnavigation = []

		if (current_user != nil && current_user.id == @idea.user_id) || admin_authorized?
			@subnavigation = [link_to_edit_idea(@idea), link_to_destroy_idea(@idea), link_to_idea_uploads(@idea)]
		end

		@idea_comments = @idea.idea_comments

		@idea_comment = IdeaComment.new
		@idea_comment.idea_id = @idea.id

		@rating = @idea.get_rating

		@uploads = @idea.uploads

		# reset view

		@idea.views = @idea.views+1
		@idea.save
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = 2)
SELECT * FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
UPDATE "ideas" SET "views" = 1, "updated_at" = '2009-05-21 21:00:28.819074' WHERE "id" = 2

  def edit
    @idea = Idea.find(params[:id])
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = E'2') LIMIT 1

  def create

		@path = [link_to_ideas, link_to_new_idea]
		@subnavigation = [active_link_to_new_idea,link_to_show_all_ideas("Alle Ideen", "title", "ASC", "", 0, 30)]

    @idea = Idea.new(params[:idea])
		@categories = Category.find(:all)


		#connection between the user and idea table/class
		current_user.ideas << @idea
---
INSERT INTO "ideas" ("created_at", "title", "updated_at", "views", "user_id", "category_id", "description") VALUES('2009-05-21 20:52:27.367532', E'Eine Idee', '2009-05-21 20:52:27.367532', NULL, 1, 1, E'<p>asdasd</p>') RETURNING "id"

  def destroy
    @idea = Idea.find(params[:id])
    	@idea.destroy
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = E'2') LIMIT 1
DELETE FROM "ideas" WHERE "id" = 2