app/controllers/innovations_controller.rb

  def index
    @innovations = Innovation.all

		@latest_innos = Innovation.find :all, :order => "created_at DESC", :limit => 5
---
SELECT * FROM "innovations"
SELECT * FROM "innovations" ORDER BY created_at DESC LIMIT 5

  def show
    @innovation = Innovation.find(params[:id])



		# reset view
		@innovation.views = @innovation.views+1
		@innovation.save
---
SELECT * FROM "innovations" WHERE ("innovations"."id" = 1)
UPDATE "innovations" SET "views" = 1, "updated_at" = '2009-05-21 21:06:37.944504' WHERE "id" = 1

	def show_all

		@categories = Category.all

		@title = params[:title]
		@order = params[:order]
		@direction = params[:direction]
		@category = params[:category]
		@user_id = params[:user_id]
		@inno = params[:inno]


		if params[:page] != nil
			@page = params[:page]
		else
			@page = 1
		end

		if @category == nil

			if @inno == nil
				@innovations = Innovation.paginate :all, :page => @page, :order => @order+" "+@direction
---
SELECT * FROM "categories"
SELECT * FROM "innovations" ORDER BY created_at DESC LIMIT 30 OFFSET 0

  def edit
    @innovation = Innovation.find(params[:id])
---
SELECT * FROM "innovations" WHERE ("innovations"."id" = E'1') LIMIT 1

  def create

		@path = [link_to_innovations]
		@subnavigation = [link_to_new_innovation]

    @innovation = Innovation.new(params[:innovation])

		@innovation.user_id = current_user.id

    respond_to do |format|
      if @innovation.save
---
INSERT INTO "innovations" ("created_at", "title", "innovation_type", "updated_at", "views", "user_id", "category_id", "description") VALUES('2009-05-21 21:05:39.805075', E'bcvb', E'OpenInnovation', '2009-05-21 21:05:39.805075', NULL, 1, 1, E'<p>bcvbvb</p>') RETURNING "id"