app/controllers/messages_controller.rb

	def create
		@user = current_user
		@message = Message.new(params[:message])
		@recipient = User.find_by_login(params[:recipient])
---
SELECT * FROM "users" WHERE ("users"."login" = E'rwer') LIMIT 1