app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" IS NULL) LIMIT 1
---
  def index
    @projects = Project.find(:all, :order => "id DESC")

INSERT INTO "project_members" ("created_at", "project_id", "updated_at", "user_id", "is_admin", "is_authorized") VALUES('2009-05-21 21:00:47.755894', 1, '2009-05-21 21:00:47.755894', 1, 't', 't') RETURNING "id"
INSERT INTO "projects" ("is_open", "category", "created_at", "title", "short_description", "updated_at", "user_id", "description") VALUES('t', NULL, '2009-05-21 21:00:47.745076', E'mbnm', E'bnmbnm', '2009-05-21 21:00:47.745076', 1, E'nmbnm') RETURNING "id"
---
  def create
    @project = Project.new(params[:project])
    @project.user_id = current_user.id
    @project_member = ProjectMember.new(:user_id => current_user.id, :is_admin => true, :is_authorized => true)
    @project.project_members << @project_member