app/controllers/project_members_controller.rb

  def index
    @authorized_projects = []
    current_user.project_members.find_all_by_is_authorized(true).each do |project_member|
---
SELECT * FROM "project_members" WHERE ("project_members"."user_id" = 1 AND "project_members"."is_authorized" = 't') AND ("project_members".project_id = 1) LIMIT 1

  def authorize
    @authorized_projects = []
    current_user.project_members.find_all_by_is_authorized(true).each do |project_member|
---
SELECT * FROM "project_members" WHERE ("project_members"."user_id" = 1 AND "project_members"."is_authorized" = 't') AND ("project_members".project_id = 1) LIMIT 1