app/controllers/tasks_controller.rb

  def index
    @project = Project.find_by_id(params[:project_id])
    if @project
      @tasks = @project.tasks.find(:all, :conditions => ["(is_private = true AND user_id = user_id) OR is_private = false", user_id = current_user.id], :order => "begins_at")
---
SELECT * FROM "projects" WHERE ("projects"."id" = E'1') LIMIT 1
SELECT * FROM "tasks" WHERE ("tasks".object_id = 1 AND "tasks".object_type = E'Project' AND ((is_private = true AND user_id = user_id) OR is_private = false)) ORDER BY begins_at