app/controllers/uploads_controller.rb

SELECT * FROM "uploads" WHERE ("uploads"."idea_id" = E'6')
SELECT * FROM "ideas" WHERE ("ideas"."id" = E'6') LIMIT 1
SELECT * FROM "projects" WHERE ("projects"."id" IS NULL) LIMIT 1
SELECT * FROM "uploads" WHERE ("uploads"."innovation_id" = E'3')
SELECT * FROM "innovations" WHERE ("innovations"."id" = E'3') LIMIT 1
---
	def new

		if params[:idea_id] != nil
			@uploads = Upload.find_all_by_idea_id(params[:idea_id])
			@type = "idea"
			@type_id = params[:idea_id]
			@form_type = :idea
			@idea = Idea.find(params[:idea_id])

			@path = [link_to_ideas, link_to_idea(@idea), link_to_idea_uploads(@idea), link_to_new_idea_upload(@idea)]
			@subnavigation = [active_link_to_new_idea_upload(@idea)]

			else if params[:project_id] != nil
				@uploads = Upload.find_all_by_project_id(params[:project_id])
				@type = "project"
				@type_id = params[:project_id]
				@form_type = :project
				@project = Project.find(params[:project_id])

				@path = [link_to_projects]
				@subnavigation = []

			else
				@uploads = Upload.find_all_by_innovation_id(params[:innovation_id])
				@type = "innovation"
				@type_id = params[:innovation_id]
				@form_type = :innovation
				@innovation = Innovation.find(params[:innovation_id])

SELECT * FROM "ideas" WHERE ("ideas"."id" = E'7') LIMIT 1
SELECT * FROM "projects" WHERE ("projects"."id" IS NULL) LIMIT 1
SELECT * FROM "innovations" WHERE ("innovations"."id" = E'3') LIMIT 1
SELECT count(*) AS count_all FROM "uploads" WHERE ("uploads".innovation_id = 3)
INSERT INTO "uploads" ("size", "created_at", "innovation_id", "content_type", "thumbnail", "updated_at", "idea_id", "project_id", "parent_id", "filename") VALUES(13889, '2009-05-22 14:47:44.827292', NULL, E'image/jpeg', NULL, '2009-05-22 14:47:44.827292', NULL, NULL, NULL, E'bett.jpg') RETURNING "id"
---
	def create
		# only 5 uploads are possible for one idea
		@restriction = 5

  	@upload = Upload.new(params[:upload])


		if params[:idea_id] != nil
			@type = Idea.find_by_id(params[:idea_id])
			else if params[:project_id] != nil
				@type = Project.find_by_id(params[:project_id])
			else
				@type = Innovation.find_by_id(params[:innovation_id])
			end
		end


		if (@type.uploads.size < @restriction)
			if @upload.save

SELECT * FROM "uploads" WHERE ("uploads"."idea_id" = E'6')
SELECT * FROM "ideas" WHERE ("ideas"."id" = 6)
SELECT * FROM "uploads" WHERE ("uploads"."innovation_id" = E'3')
SELECT * FROM "innovations" WHERE ("innovations"."id" = 3)
---
	def index

		if params[:idea_id] != nil
			@uploads = Upload.find_all_by_idea_id(params[:idea_id])
			@idea = Idea.find(params[:idea_id])

			@path = [link_to_ideas, link_to_idea(@idea), link_to_idea_uploads(@idea)]
			@subnavigation = [link_to_new_idea_upload(@idea)]

			else if params[:project_id] != nil
				@uploads = Upload.find_all_by_project_id(params[:project_id])

			else
				@uploads = Upload.find_all_by_innovation_id(params[:innovation_id])
				@innovation = Innovation.find(params[:innovation_id])