app/controllers/users_controller.rb

  def create
		@path = [link_to_signup]
		@subnavigation = []

    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session

    @user = User.new(params[:user])

		# for the user details
		@user_detail = UserDetail.new(params[:user_detail])

		@user.user_detail = @user_detail

		# what will be the login name be
		if params[:last_name_check] == "1"
			@user.login = @user_detail.last_name
		else
			@user.login = @user_detail.first_name + " " + @user_detail.last_name
		end


		valid1 = @user.valid?
		valid2 = @user_detail.valid?

		if valid1 && valid2
			@user.save!
---
SELECT "users".id FROM "users" WHERE (LOWER("users"."login") = E'florian klein') LIMIT 1
INSERT INTO "user_details" ("expert_description", "city", "created_at", "title", "country", "expert_in_category_id", "postal_code", "mobile_phone_number", "updated_at", "level", "gender", "street", "phone_number", "user_id", "last_name", "birthday", "branche", "house_number", "first_name", "profession") VALUES(E'', E'', '2009-05-21 20:51:49.943691', E'', E'Germany', 1, NULL, NULL, '2009-05-21 20:51:49.943691', NULL, E'Herr', E'', NULL, 1, E'Klein', NULL, E'vnvbnv', NULL, E'Florian', E'nbvnvb') RETURNING "id"
INSERT INTO "users" ("salt", "activated_at", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "admin", "remember_token", "login", "email") VALUES(E'e4f632ba9fee050c90799e58330cf3aacc14985f', NULL, '2009-05-21 20:51:49.934590', E'952c116e42b830c0817ff6aead705a4ecd6eff42', NULL, '2009-05-21 20:51:49.934590', E'8e55cacd51a7781d685cdd4be5e4d570b2813f27', NULL, NULL, E'Florian Klein', E'floklein@hotmail.com') RETURNING "id"

	def index

		@user = current_user


		@path = [link_to_user(@user)]
		@subnavigation = [active_link_to_user(@user), link_to_edit_user_user_detail(@user), link_to_user_user_detail(@user), link_to_messages]

		@message_count = current_user.mailbox[:inbox].unread_mail.size
---
SELECT * FROM "mail" WHERE ("mail".user_id = 1 AND ((mail.read = 'f') AND (mail.mailbox = E'inbox' AND mail.trashed = 'f'))) ORDER BY created_at DESC