app/controllers/user_details_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
---
  def show
		@user = User.find_by_id(params[:user_id]) || current_user